Autodesk.Revit.DB.ElementComparisonResult
Enumerated values of the result of comparing two objects for sorting purposes.
Since:
2015

Autodesk.Revit.DB.ElementComparisonResult.Incomparable
Two objects cannot be compared due to their different type or incompatible nature.

Autodesk.Revit.DB.ElementComparisonResult.Reversed
Two objects differ and are in reversed order, meaning the first one is bigger than the second one.

Autodesk.Revit.DB.ElementComparisonResult.Ordered
Two objects differ, but are correctly ordered, meaning the first one is smaller than the second one.

Autodesk.Revit.DB.ElementComparisonResult.Equal
Two objects being compared are considered equal.